programs = [
    "Экономика",
    "Бизнес-информатика",
    "Туризм"
]
subjects = [
    "Эконометрика",
    "Базы данных",
    "Теория игр",
    "Программирование на Python"
]
olimpiads = [
    "Олимпиада по математике",
    "Олимпиада по программированию",
    "Олимпиада по хакингу"
]
subject_dict = {
    "Эконометрика": "наука, изучающая количественные и качественные экономические взаимосвязи с помощью статистических и других математических методов и моделей.",
    "Базы данных": "упорядоченный набор структурированной информации или данных, которые обычно хранятся в электронном виде в компьютерной системе.",
    "Теория игр": " математический метод изучения оптимальных стратегий в играх. ",
    "Программирование на Python": "высокоуровневый язык программирования общего назначения, который используется в том числе и для разработки веб-приложений."
}
olimpiads_dict = {
    "Олимпиада по математике": "какое то описание чего то",
    "Олимпиада по программированию": "какое то описание чего то",
    "Олимпиада по хакингу": "какое то описание чего то"
}
